Revit 2027 API
IFCUserDefinedProperty.DataTypeDefined Property
 The defined value data type of the table property.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string DataTypeDefined { get; set; }
Public Property DataTypeDefined As String
	Get
	Set
public:
property String^ DataTypeDefined {
	String^ get ();
	void set (String^ value);
}
member DataTypeDefined : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCUserDefinedProperty Class
Autodesk.Revit.DB Namespace